MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS102A/mcu.h
#define _PWMCAP1_PWMCAP16_POSITION               0x00000009
#define _PWMCAP1_PWMCAP16_MASK                   0x00000200
#define _PWMCAP1_PWMCAP16_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP17_POSITION               0x0000000A
#define _PWMCAP1_PWMCAP17_MASK                   0x00000400
#define _PWMCAP1_PWMCAP17_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP18_POSITION               0x0000000B
#define _PWMCAP1_PWMCAP18_MASK                   0x00000800
#define _PWMCAP1_PWMCAP18_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP19_POSITION               0x0000000C
#define _PWMCAP1_PWMCAP19_MASK                   0x00001000
#define _PWMCAP1_PWMCAP19_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP110_POSITION              0x0000000D
#define _PWMCAP1_PWMCAP110_MASK                  0x00002000
#define _PWMCAP1_PWMCAP110_LENGTH                0x00000001

#define _PWMCAP1_PWMCAP111_POSITION              0x0000000E
#define _PWMCAP1_PWMCAP111_MASK                  0x00004000
#define _PWMCAP1_PWMCAP111_LENGTH                0x00000001

#define _PWMCAP1_PWMCAP112_POSITION              0x0000000F
#define _PWMCAP1_PWMCAP112_MASK                  0x00008000
#define _PWMCAP1_PWMCAP112_LENGTH                0x00000001

#define _LEBCON1_LEB_POSITION                    0x00000003
#define _LEBCON1_LEB_MASK                        0x000003F8
#define _LEBCON1_LEB_LENGTH                      0x00000007

#define _LEBCON1_CLLEBEN_POSITION                0x0000000A
#define _LEBCON1_CLLEBEN_MASK                    0x00000400
#define _LEBCON1_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON1_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON1_FLTLEBEN_MASK                   0x00000800
#define _LEBCON1_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON1_PLF_POSITION                    0x0000000C
#define _LEBCON1_PLF_MASK                        0x00001000
#define _LEBCON1_PLF_LENGTH                      0x00000001

#define _LEBCON1_PLR_POSITION                    0x0000000D
#define _LEBCON1_PLR_MASK                        0x00002000
#define _LEBCON1_PLR_LENGTH                      0x00000001

#define _LEBCON1_PHF_POSITION                    0x0000000E
#define _LEBCON1_PHF_MASK                        0x00004000
#define _LEBCON1_PHF_LENGTH                      0x00000001

#define _LEBCON1_PHR_POSITION                    0x0000000F
#define _LEBCON1_PHR_MASK                        0x00008000
#define _LEBCON1_PHR_LENGTH                      0x00000001

#define _LEBCON1_LEB0_POSITION                   0x00000003
#define _LEBCON1_LEB0_MASK                       0x00000008
#define _LEBCON1_LEB0_LENGTH                     0x00000001

#define _LEBCON1_LEB1_POSITION                   0x00000004
#define _LEBCON1_LEB1_MASK                       0x00000010
#define _LEBCON1_LEB1_LENGTH                     0x00000001

#define _LEBCON1_LEB2_POSITION                   0x00000005
#define _LEBCON1_LEB2_MASK                       0x00000020
#define _LEBCON1_LEB2_LENGTH                     0x00000001

#define _LEBCON1_LEB3_POSITION                   0x00000006
#define _LEBCON1_LEB3_MASK                       0x00000040
#define _LEBCON1_LEB3_LENGTH                     0x00000001

#define _LEBCON1_LEB4_POSITION                   0x00000007
#define _LEBCON1_LEB4_MASK                       0x00000080
#define _LEBCON1_LEB4_LENGTH                     0x00000001

#define _LEBCON1_LEB5_POSITION                   0x00000008
#define _LEBCON1_LEB5_MASK                       0x00000100
#define _LEBCON1_LEB5_LENGTH                     0x00000001

#define _LEBCON1_LEB6_POSITION                   0x00000009
#define _LEBCON1_LEB6_MASK                       0x00000200
#define _LEBCON1_LEB6_LENGTH                     0x00000001

#define _AUXCON1_CHOPLEN_POSITION                0x00000000
#define _AUXCON1_CHOPLEN_MASK                    0x00000001
#define _AUXCON1_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON1_CHOPHEN_POSITION                0x00000001
#define _AUXCON1_CHOPHEN_MASK                    0x00000002
#define _AUXCON1_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON1_CHOPSEL_POSITION                0x00000002
#define _AUXCON1_CHOPSEL_MASK                    0x0000003C
#define _AUXCON1_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON1_HRDDIS_POSITION                 0x0000000E
#define _AUXCON1_HRDDIS_MASK                     0x00004000
#define _AUXCON1_HRDDIS_LENGTH                   0x00000001

#define _AUXCON1_HRPDIS_POSITION                 0x0000000F
#define _AUXCON1_HRPDIS_MASK                     0x00008000
#define _AUXCON1_HRPDIS_LENGTH                   0x00000001

#define _PWMCON2_IUE_POSITION                    0x00000000
#define _PWMCON2_IUE_MASK                        0x00000001
#define _PWMCON2_IUE_LENGTH                      0x00000001

#define _PWMCON2_XPRES_POSITION                  0x00000001
#define _PWMCON2_XPRES_MASK                      0x00000002
#define _PWMCON2_XPRES_LENGTH                    0x00000001

#define _PWMCON2_CAM_POSITION                    0x00000002
#define _PWMCON2_CAM_MASK                        0x00000004
#define _PWMCON2_CAM_LENGTH                      0x00000001

#define _PWMCON2_DTC_POSITION                    0x00000006
#define _PWMCON2_DTC_MASK                        0x000000C0
#define _PWMCON2_DTC_LENGTH                      0x00000002

#define _PWMCON2_MDCS_POSITION                   0x00000008
#define _PWMCON2_MDCS_MASK                       0x00000100
#define _PWMCON2_MDCS_LENGTH                     0x00000001

#define _PWMCON2_ITB_POSITION                    0x00000009
#define _PWMCON2_ITB_MASK                        0x00000200
#define _PWMCON2_ITB_LENGTH                      0x00000001

#define _PWMCON2_TRGIEN_POSITION                 0x0000000A
#define _PWMCON2_TRGIEN_MASK                     0x00000400
#define _PWMCON2_TRGIEN_LENGTH                   0x00000001

#define _PWMCON2_CLIEN_POSITION                  0x0000000B
#define _PWMCON2_CLIEN_MASK                      0x00000800
#define _PWMCON2_CLIEN_LENGTH                    0x00000001

