MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS102A/mcu.h
#define _RPOR7_RP15R3_POSITION                   0x0000000B
#define _RPOR7_RP15R3_MASK                       0x00000800
#define _RPOR7_RP15R3_LENGTH                     0x00000001

#define _RPOR7_RP15R4_POSITION                   0x0000000C
#define _RPOR7_RP15R4_MASK                       0x00001000
#define _RPOR7_RP15R4_LENGTH                     0x00000001

#define _RPOR7_RP15R5_POSITION                   0x0000000D
#define _RPOR7_RP15R5_MASK                       0x00002000
#define _RPOR7_RP15R5_LENGTH                     0x00000001

#define _RPOR16_RP32R_POSITION                   0x00000000
#define _RPOR16_RP32R_MASK                       0x0000003F
#define _RPOR16_RP32R_LENGTH                     0x00000006

#define _RPOR16_RP33R_POSITION                   0x00000008
#define _RPOR16_RP33R_MASK                       0x00003F00
#define _RPOR16_RP33R_LENGTH                     0x00000006

#define _RPOR16_RP32R0_POSITION                  0x00000000
#define _RPOR16_RP32R0_MASK                      0x00000001
#define _RPOR16_RP32R0_LENGTH                    0x00000001

#define _RPOR16_RP32R1_POSITION                  0x00000001
#define _RPOR16_RP32R1_MASK                      0x00000002
#define _RPOR16_RP32R1_LENGTH                    0x00000001

#define _RPOR16_RP32R2_POSITION                  0x00000002
#define _RPOR16_RP32R2_MASK                      0x00000004
#define _RPOR16_RP32R2_LENGTH                    0x00000001

#define _RPOR16_RP32R3_POSITION                  0x00000003
#define _RPOR16_RP32R3_MASK                      0x00000008
#define _RPOR16_RP32R3_LENGTH                    0x00000001

#define _RPOR16_RP32R4_POSITION                  0x00000004
#define _RPOR16_RP32R4_MASK                      0x00000010
#define _RPOR16_RP32R4_LENGTH                    0x00000001

#define _RPOR16_RP32R5_POSITION                  0x00000005
#define _RPOR16_RP32R5_MASK                      0x00000020
#define _RPOR16_RP32R5_LENGTH                    0x00000001

#define _RPOR16_RP33R0_POSITION                  0x00000008
#define _RPOR16_RP33R0_MASK                      0x00000100
#define _RPOR16_RP33R0_LENGTH                    0x00000001

#define _RPOR16_RP33R1_POSITION                  0x00000009
#define _RPOR16_RP33R1_MASK                      0x00000200
#define _RPOR16_RP33R1_LENGTH                    0x00000001

#define _RPOR16_RP33R2_POSITION                  0x0000000A
#define _RPOR16_RP33R2_MASK                      0x00000400
#define _RPOR16_RP33R2_LENGTH                    0x00000001

#define _RPOR16_RP33R3_POSITION                  0x0000000B
#define _RPOR16_RP33R3_MASK                      0x00000800
#define _RPOR16_RP33R3_LENGTH                    0x00000001

#define _RPOR16_RP33R4_POSITION                  0x0000000C
#define _RPOR16_RP33R4_MASK                      0x00001000
#define _RPOR16_RP33R4_LENGTH                    0x00000001

#define _RPOR16_RP33R5_POSITION                  0x0000000D
#define _RPOR16_RP33R5_MASK                      0x00002000
#define _RPOR16_RP33R5_LENGTH                    0x00000001

#define _RPOR17_RP34R_POSITION                   0x00000000
#define _RPOR17_RP34R_MASK                       0x0000003F
#define _RPOR17_RP34R_LENGTH                     0x00000006

#define _RPOR17_RP35R_POSITION                   0x00000008
#define _RPOR17_RP35R_MASK                       0x00003F00
#define _RPOR17_RP35R_LENGTH                     0x00000006

#define _RPOR17_RP34R0_POSITION                  0x00000000
#define _RPOR17_RP34R0_MASK                      0x00000001
#define _RPOR17_RP34R0_LENGTH                    0x00000001

#define _RPOR17_RP34R1_POSITION                  0x00000001
#define _RPOR17_RP34R1_MASK                      0x00000002
#define _RPOR17_RP34R1_LENGTH                    0x00000001

#define _RPOR17_RP34R2_POSITION                  0x00000002
#define _RPOR17_RP34R2_MASK                      0x00000004
#define _RPOR17_RP34R2_LENGTH                    0x00000001

#define _RPOR17_RP34R3_POSITION                  0x00000003
#define _RPOR17_RP34R3_MASK                      0x00000008
#define _RPOR17_RP34R3_LENGTH                    0x00000001

#define _RPOR17_RP34R4_POSITION                  0x00000004
#define _RPOR17_RP34R4_MASK                      0x00000010
#define _RPOR17_RP34R4_LENGTH                    0x00000001

#define _RPOR17_RP34R5_POSITION                  0x00000005
#define _RPOR17_RP34R5_MASK                      0x00000020
#define _RPOR17_RP34R5_LENGTH                    0x00000001

#define _RPOR17_RP35R0_POSITION                  0x00000008
#define _RPOR17_RP35R0_MASK                      0x00000100
#define _RPOR17_RP35R0_LENGTH                    0x00000001

#define _RPOR17_RP35R1_POSITION                  0x00000009
#define _RPOR17_RP35R1_MASK                      0x00000200
#define _RPOR17_RP35R1_LENGTH                    0x00000001

#define _RPOR17_RP35R2_POSITION                  0x0000000A
#define _RPOR17_RP35R2_MASK                      0x00000400
#define _RPOR17_RP35R2_LENGTH                    0x00000001

#define _RPOR17_RP35R3_POSITION                  0x0000000B
#define _RPOR17_RP35R3_MASK                      0x00000800
#define _RPOR17_RP35R3_LENGTH                    0x00000001

#define _RPOR17_RP35R4_POSITION                  0x0000000C
#define _RPOR17_RP35R4_MASK                      0x00001000
#define _RPOR17_RP35R4_LENGTH                    0x00000001

#define _RPOR17_RP35R5_POSITION                  0x0000000D
#define _RPOR17_RP35R5_MASK                      0x00002000
#define _RPOR17_RP35R5_LENGTH                    0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_CM_POSITION                        0x00000009
#define _RCON_CM_MASK                            0x00000200
#define _RCON_CM_LENGTH                          0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

